from res.general_text import BACK_BUTTON_TEXT

CREATE_NEW_PURCHASE_HELLO_TEXT = f"""📦 Создание закупки

Отправьте 3 отдельных сообщения.

В 1 сообщении укажите:
1. Ваше уникальное имя закупки — его вы будете видеть в общем списке закупок

Во 2 сообщении укажите:
2. Идентификатор лота 

В 3 сообщении укажите:
3. Идентификатор заказчика

Далее вы автоматически перейдете к управлению закупкой.


↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

CREATE_NEW_PURCHASE_SUCCESS_TEXT = f"""Отлично! Вы успешно создали и выбрали закупку."""
