START_COMMAND = 'start'

BOT_HELLO_MESSAGE = f"""<b>Добро пожаловать! Я умный ассистент по закупкам👨‍💻</b>"""

BACK_BUTTON_TEXT = 'Назад'

SOMETHING_WRONG = 'Что-то пошло не так'
PERMISSION_RIGHTS_ERROR_TEXT = "Недостаточно прав"

YEAR_TEXT = "Год"
MONTH_TEXT = "Месяц"
QUARTER_TEXT = "Квартал"

NOTHING_GOT_FROM_SERVER_TEXT = f"""Не удалось получить результат по данному запросу, так как по данному товару в 
системе не содержится достаточно исходных данных для анализа. Попробуйте другой запрос.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""
