from res.general_text import BACK_BUTTON_TEXT

PURCHASES_STATISTIC_BUTTON_TEXT = "Статистика по закупкам"
TOP_EXPENSIVE_BUTTON_TEXT = "Самые дорогие закупки"

AMOUNT_OF_PURCHASES_BUTTON_TEXT = "Количество закупок"
PRICE_OF_PURCHASES_BUTTON_TEXT = "Цена закупок"

COMMON_PURCHASES_STATISTIC_HELLO_TEXT = f"""📊 Общий анализ закупок

🗓 По кнопке <b>{PURCHASES_STATISTIC_BUTTON_TEXT}</b> вы можете посмотреть общую статистику по закупкам за разные временные периоды.

💸 По кнопке <b>{TOP_EXPENSIVE_BUTTON_TEXT}</b> вы можете посмотреть список из максмум 15 самых дорогих закупок, совершенных за последнее время. 
  
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

PURCHASES_STATISTIC_MESSAGE_TEXT = f"""📊 Статистика по закупкам 
 
В этом разделе вы можете видеть общую аналитику по вашим закупкам и ознакомиться с графиками. 
 
— *стата* 
— *стата* 
— *стата* 
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

TOP_EXPENSIVE_MESSAGE_TEXT = f"""📊 Самые дорогие закупки

Рейтинг самых дорогих закупок за последний месяц, квартал, год.

— *закупка*
— *закупка*
— *закупка*

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""
