from res.general_text import BACK_BUTTON_TEXT

HELP_BUTTON_TEXT = "Помощь"
CONTINUE_BUTTON_TEXT = "Продолжить"

EXIT_BUTTON_TEXT = "Выйти из аккаунта"
INFO_TEXT = f"""
✅ Нажмите кнопку <b>{CONTINUE_BUTTON_TEXT}</b>, чтобы ознакомиться со всеми возможностями бота и приступить к использованию.

❎ Нажмите кнопку <b>{EXIT_BUTTON_TEXT}</b>, чтобы разлогиниться.

❓Если возникнут какие-либо вопросы или нужно сообщить об ошибке, нажмите на кнопку <b>{HELP_BUTTON_TEXT}</b>.

Успешной работы!"""

HELP_TEXT = f"""❓<b>Помощь</b>

◽️ Для начала работы нажмите на синюю кнопку <b>Меню</b> слева от строки ввода, а после на кнопку <b>Старт</b>. Либо 
самостоятельно отправьте сообщение с текстом /start

◽️ Если у вас возникли сложности или ошибки при работе с ботом, сообщите нам об этом @domster407

◽️ Следуйте инструкциям в сообщениях, чтобы найти нужную вам функцию. Приятной работы!


↩️ Чтобы вернуться, нажмите кнопку Назад."""

ASSERT_BUTTON_TEXT = "Сообщить об ошибке"

ASSERT_MESSAGE_TEXT = f"Введите сообщение, которое будет отправлено разработчикам"
ASSERT_MESSAGE_SUCCESS = f"Сообщение об ошибке отправлено успешно"

EXIT_SUCCESS_TEXT = "Вы успешно вышли из аккаунта"
