from tg_bot.res.general_text import BACK_BUTTON_TEXT

ENTER_PRODUCT_NAME_BUTTON_TEXT = "Введите название товара"
ACTIVE_PURCHASE_BUTTON_TEXT = "Активные закупки"
COMMON_ANALYSIS_BUTTON_TEXT = "Общий анализ закупок"
BALANCE_BUTTON_TEXT = "Баланс"
CREATE_PURCHASE_BUTTON_TEXT = "Создание закупки"
CHOOSE_PURCHASE_BUTTON_TEXT = "Выбор закупки"

ACTION_LIST_HELLO_TEXT = f"""Выберите действие, которое вы хотите выполнить:  
  
🔎 По кнопке <b>{ENTER_PRODUCT_NAME_BUTTON_TEXT}</b> вы можете получить прогноз потребности в товаре с учетом 
складских остатков, увидеть детальную статистику по товару и создать закупку.
  
📦 По кнопке <b>{ACTIVE_PURCHASE_BUTTON_TEXT}</b> вы можете просмотреть список всех текущих закупок, доступных к 
редактированию.
  
📊 По кнопке <b>{COMMON_ANALYSIS_BUTTON_TEXT}</b> вы можете узнать общую статистику по закупкам за разные периоды 
времени, а также увидеть рейтинг самых крупных закупок за последнее время.
  
💰 По кнопке <b>{BALANCE_BUTTON_TEXT}</b> вы можете задать значения баланса для субсчетов или отредактировать их.
  
↩️ По кнопке <b>{BACK_BUTTON_TEXT}</b> вы вернетесь на предыдущий этап"""
