from tg_bot.res.general_text import BACK_BUTTON_TEXT

INFO_BALANCE_BUTTON_TEXT = "Информация о балансе"
EDIT_BALANCE_BUTTON_TEXT = "Редактировать баланс"

BALANCE_HELLO_TEXT = f"""💰 Баланс  
  
Выберите действие, которое вы хотите выполнить с балансом при помощи кнопок 🧾 <b>{INFO_BALANCE_BUTTON_TEXT}</b> 
и ✏️ <b>{EDIT_BALANCE_BUTTON_TEXT}</b>.
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

INFO_BALANCE_MESSAGE_TEXT = f"""💰 Информация о балансе  
  
В настоящее время на ваших субсчетах содержится следующий баланс:

— *счет*
— *счет*
— *счет*
  
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

INPUT_BALANCE_ACCOUNT_MESSAGE_TEXT = f"""💰 Редактировать баланс

Введите номер субсчета для редактирования баланса.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

INPUT_BALANCE_SUM_MESSAGE_TEXT = f"""💰 Редактировать баланс 
 
Введите сумму рублей, которую необходимо зачислить на баланс. Только цифры. 
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""
