from res.general_text import BACK_BUTTON_TEXT

PURCHASES_STATISTIC_BUTTON_TEXT = "Статистика по закупкам"
TOP_EXPENSIVE_BUTTON_TEXT = "Самые дорогие закупки"

AMOUNT_OF_PURCHASES_BUTTON_TEXT = "Количество закупок"
PRICE_OF_PURCHASES_BUTTON_TEXT = "Цена закупок"

COMMON_PURCHASES_STATISTIC_HELLO_TEXT = f"""📊 Общий анализ закупок

🗓 По кнопке <b>{PURCHASES_STATISTIC_BUTTON_TEXT}</b> вы можете посмотреть общую статистику по закупкам за разные 
временные периоды.

💸 По кнопке <b>{TOP_EXPENSIVE_BUTTON_TEXT}</b> вы можете посмотреть список самых дорогих закупок, совершенных за 
последнее время.
  
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

ENTER_N_EXPENSIVE_PURCHASES_MESSAGE_TEXT = f"""💸 Самые дорогие закупки

Введите цифрами число, сколько самых дорогих закупок за последнее время вы хотите отобразить.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

CHOSE_STATISTIC_PERIOD_TEXT = f"""🗓 Статистика по закупкам

Выберите период, общую статистику за который вы хотите просмотреть. 

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

PURCHASES_STATISTIC_AMOUNT_TEXT = f"""🗓 Статистика по закупкам 
 
Сейчас отображается общая статистика по количеству закупок за выбранный вами период. Вы можете также просмотреть 
статистику по <b>Цене закупок</b> по кнопке в меню.
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

PURCHASES_STATISTIC_PRICE_TEXT = f"""🗓 Статистика по закупкам 
 
Сейчас отображается общая статистика по ценам закупок за выбранный вами период. Вы можете также просмотреть 
статистику по <b>Количеству закупок</b> по кнопке в меню.
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

GENERAL_STATISTIC_CHOSE_TYPE_TEXT = f"""🗓 Статистика по закупкам

Выберите, какую статистику вы хотите отобразить: по количеству закупок или по цене закупок.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""
