from res.general_text import BACK_BUTTON_TEXT

HOW_MANY_ITEMS_LEFT_BUTTON_TEXT = 'Сколько осталось товара'
LAST_N_PURCHASE_BUTTON_TEXT = 'Последние N закупок'
DEBIT_CREDIT_PRODUCT_BUTTON_TEXT = 'Оборот дебет/кредит'
STATISTIC_BUTTON_TEXT = 'Статистика закупок'

PRODUCT_ANALYSIS_HELLO_TEXT = f"""📊 <b>Аналитика по товару</b>

Выберите действие, которое хотите выполнить:

Кнопка <b>{HOW_MANY_ITEMS_LEFT_BUTTON_TEXT}</b> позволит узнать складские остатки товара.

По кнопке <b>{LAST_N_PURCHASE_BUTTON_TEXT}</b> вы получите полную информацию по последним закупкам товара в формате 
Excel.

По кнопке <b>{STATISTIC_BUTTON_TEXT}</b> вы получите статистику закупок товара по цене и количеству по месяцам, 
кварталам и годам.

Также вы можете посмотреть информацию по Обороту дебет/кредит при нажатии на кнопку <b>{DEBIT_CREDIT_PRODUCT_BUTTON_TEXT}</b>.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

PRICE_BUTTON_TEXT = 'Сумма'
AMOUNT_BUTTON_TEXT = 'Количество'

PRICE_DEBIT_CREDIT_PRODUCT_MESSAGE_TEXT = f"""<b>Оборот дебет/кредит</b>. 
  
Сейчас отображается общая статистика по обороту дебет/кредит <b>По ценам</b>. Вы можете также просмотреть статистику по 
обороту дебет/кредит <b>По количеству</b> по кнопке в меню.
  
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

AMOUNT_DEBIT_CREDIT_PRODUCT_MESSAGE_TEXT = f"""<b>Оборот дебет/кредит</b>.  
  
Сейчас отображается общая статистика по обороту дебет/кредит <b>По количеству</b>. Вы можете также просмотреть 
статистику по обороту дебет/кредит <b>По ценам</b> по кнопке в меню.
  
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

DEBIT_CREDIT_PRODUCT_MESSAGE_TEXT = f"""<b>Оборот дебет/кредит</b>.

Выберите, какую статистику вы хотите просмотреть: <b>по количеству</b> или <b>по цене</b>.

↩️ Чтобы вернуться, нажмите кнопку Назад."""

STATISTIC_PRODUCT_PERIOD_TEXT = f"""<b>Статистика закупок товара</b>

Выберите временной период, за который хотите просмотреть статистику.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

STATISTIC_PRODUCT_TYPE_TEXT = f"""<b>Статистика закупок товара</b>
 
Выберите, по чему хотите посмотреть статистику товара: <b>По ценам</b> закупок или <b>По количеству</b> закупок. 
 
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

PRICE_STATISTIC_PRODUCT_MESSAGE_TEXT = f"""<b>Статистика закупок товара</b>
   
Сейчас отображается статистика закупок товара <b>По ценам</b> закупок. Вы можете также просмотреть статистику <b>По 
количеству закупок</b> по кнопке в меню.
   
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

AMOUNT_STATISTIC_PRODUCT_MESSAGE_TEXT = f"""<b>Статистика закупок товара</b>
   
Сейчас отображается статистика закупок товара <b>По количеству закупок</b>. Вы можете также просмотреть статистику 
<b>По ценам</b> закупок по кнопке в меню.
   
↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""

ENTER_LAST_N_PRODUCT_MESSAGE_TEXT = f"""<b>Последние N закупок</b>.

Введите цифрами число, сколько самых последних закупок выбранного товара вы хотите отобразить.

↩️ Чтобы вернуться, нажмите кнопку <b>{BACK_BUTTON_TEXT}</b>."""
